micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_pins.h
/*******************************************************************************
 * File Name: cycfg_pins.h
 *
 * Description:
 * Pin configuration
 * This file was automatically generated and should not be modified.
 * Configurator Backend 3.60.0
 * device-db 4.34.0.9502
 * mtb-dsl-pse8xxgp 1.2.0.895
 *
 *******************************************************************************
 * Copyright 2026 Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 ******************************************************************************/

#if !defined(CYCFG_PINS_H)
#define CYCFG_PINS_H

#include "cycfg_notices.h"
#include "cy_gpio.h"
#include "cycfg_routing.h"

#if defined(__cplusplus)
extern "C" {
#endif /* defined(__cplusplus) */

#define CYBSP_OSPI_RAM_CS_ENABLED 1U
#define CYBSP_OSPI_RAM_SS_ENABLED CYBSP_OSPI_RAM_CS_ENABLED
#define CYBSP_OSPI_RAM_CS_PORT GPIO_PRT0
#define CYBSP_OSPI_RAM_SS_PORT CYBSP_OSPI_RAM_CS_PORT
#define CYBSP_OSPI_RAM_CS_PORT_NUM 0U
#define CYBSP_OSPI_RAM_SS_PORT_NUM CYBSP_OSPI_RAM_CS_PORT_NUM
#define CYBSP_OSPI_RAM_CS_PIN 1U
#define CYBSP_OSPI_RAM_SS_PIN CYBSP_OSPI_RAM_CS_PIN
#define CYBSP_OSPI_RAM_CS_NUM 1U
#define CYBSP_OSPI_RAM_SS_NUM CYBSP_OSPI_RAM_CS_NUM
#define CYBSP_OSPI_RAM_CS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_OSPI_RAM_SS_DRIVEMODE CYBSP_OSPI_RAM_CS_DRIVEMODE
#define CYBSP_OSPI_RAM_CS_INIT_DRIVESTATE 1
#define CYBSP_OSPI_RAM_SS_INIT_DRIVESTATE CYBSP_OSPI_RAM_CS_INIT_DRIVESTATE
#ifndef ioss_0_port_0_pin_1_HSIOM
    #define ioss_0_port_0_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_OSPI_RAM_CS_HSIOM ioss_0_port_0_pin_1_HSIOM
#define CYBSP_OSPI_RAM_SS_HSIOM CYBSP_OSPI_RAM_CS_HSIOM
#define CYBSP_OSPI_RAM_CS_IRQ ioss_interrupts_gpio_0_IRQn
#define CYBSP_OSPI_RAM_SS_IRQ CYBSP_OSPI_RAM_CS_IRQ
#define CYBSP_QSPI_D0_ENABLED 1U
#define CYBSP_QSPI_D0_PORT (GPIO_PRT_Type *)SMIF0_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_QSPI_D0_PORT_NUM 1U
#define CYBSP_QSPI_D0_PIN 0U
#define CYBSP_QSPI_D0_NUM 0U
#define CYBSP_QSPI_D0_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_QSPI_D0_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_0_HSIOM
    #define ioss_0_port_1_pin_0_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_QSPI_D0_HSIOM ioss_0_port_1_pin_0_HSIOM
#define CYBSP_QSPI_D0_IRQ ioss_interrupts_gpio_1_IRQn
#define CYBSP_QSPI_D1_ENABLED 1U
#define CYBSP_QSPI_D1_PORT (GPIO_PRT_Type *)SMIF0_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_QSPI_D1_PORT_NUM 1U
#define CYBSP_QSPI_D1_PIN 1U
#define CYBSP_QSPI_D1_NUM 1U
#define CYBSP_QSPI_D1_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_QSPI_D1_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_1_HSIOM
    #define ioss_0_port_1_pin_1_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_QSPI_D1_HSIOM ioss_0_port_1_pin_1_HSIOM
#define CYBSP_QSPI_D1_IRQ ioss_interrupts_gpio_1_IRQn
#define CYBSP_QSPI_D2_ENABLED 1U
#define CYBSP_QSPI_D2_PORT (GPIO_PRT_Type *)SMIF0_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_QSPI_D2_PORT_NUM 1U
#define CYBSP_QSPI_D2_PIN 2U
#define CYBSP_QSPI_D2_NUM 2U
#define CYBSP_QSPI_D2_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_QSPI_D2_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_2_HSIOM
    #define ioss_0_port_1_pin_2_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_QSPI_D2_HSIOM ioss_0_port_1_pin_2_HSIOM
#define CYBSP_QSPI_D2_IRQ ioss_interrupts_gpio_1_IRQn
#define CYBSP_QSPI_D3_ENABLED 1U
#define CYBSP_QSPI_D3_PORT (GPIO_PRT_Type *)SMIF0_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_QSPI_D3_PORT_NUM 1U
#define CYBSP_QSPI_D3_PIN 3U
#define CYBSP_QSPI_D3_NUM 3U
#define CYBSP_QSPI_D3_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_QSPI_D3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_3_HSIOM
    #define ioss_0_port_1_pin_3_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_QSPI_D3_HSIOM ioss_0_port_1_pin_3_HSIOM
#define CYBSP_QSPI_D3_IRQ ioss_interrupts_gpio_1_IRQn
#define CYBSP_QSPI_CS_ENABLED 1U
#define CYBSP_QSPI_SS_ENABLED CYBSP_QSPI_CS_ENABLED
#define CYBSP_QSPI_CS_PORT GPIO_PRT2
#define CYBSP_QSPI_SS_PORT CYBSP_QSPI_CS_PORT
#define CYBSP_QSPI_CS_PORT_NUM 2U
#define CYBSP_QSPI_SS_PORT_NUM CYBSP_QSPI_CS_PORT_NUM
#define CYBSP_QSPI_CS_PIN 0U
#define CYBSP_QSPI_SS_PIN CYBSP_QSPI_CS_PIN
#define CYBSP_QSPI_CS_NUM 0U
#define CYBSP_QSPI_SS_NUM CYBSP_QSPI_CS_NUM
#define CYBSP_QSPI_CS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_QSPI_SS_DRIVEMODE CYBSP_QSPI_CS_DRIVEMODE
#define CYBSP_QSPI_CS_INIT_DRIVESTATE 1
#define CYBSP_QSPI_SS_INIT_DRIVESTATE CYBSP_QSPI_CS_INIT_DRIVESTATE
#ifndef ioss_0_port_2_pin_0_HSIOM
    #define ioss_0_port_2_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_QSPI_CS_HSIOM ioss_0_port_2_pin_0_HSIOM
#define CYBSP_QSPI_SS_HSIOM CYBSP_QSPI_CS_HSIOM
#define CYBSP_QSPI_CS_IRQ ioss_interrupts_gpio_2_IRQn
#define CYBSP_QSPI_SS_IRQ CYBSP_QSPI_CS_IRQ
#define CYBSP_I3C_SCL_ENABLED 1U
#define CYBSP_I3C_SCL_PORT GPIO_PRT3
#define CYBSP_I3C_SCL_PORT_NUM 3U
#define CYBSP_I3C_SCL_PIN 0U
#define CYBSP_I3C_SCL_NUM 0U
#define CYBSP_I3C_SCL_DRIVEMODE CY_GPIO_DM_CFGOUT3_STRONG_PULLUP_HIGHZ
#define CYBSP_I3C_SCL_INIT_DRIVESTATE 1
#ifndef ioss_0_port_3_pin_0_HSIOM
    #define ioss_0_port_3_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I3C_SCL_HSIOM ioss_0_port_3_pin_0_HSIOM
#define CYBSP_I3C_SCL_IRQ ioss_interrupts_gpio_3_IRQn
#define CYBSP_I3C_SDA_ENABLED 1U
#define CYBSP_I3C_SDA_PORT GPIO_PRT3
#define CYBSP_I3C_SDA_PORT_NUM 3U
#define CYBSP_I3C_SDA_PIN 1U
#define CYBSP_I3C_SDA_NUM 1U
#define CYBSP_I3C_SDA_DRIVEMODE CY_GPIO_DM_CFGOUT3_STRONG_PULLUP_HIGHZ
#define CYBSP_I3C_SDA_INIT_DRIVESTATE 1
#ifndef ioss_0_port_3_pin_1_HSIOM
    #define ioss_0_port_3_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I3C_SDA_HSIOM ioss_0_port_3_pin_1_HSIOM
#define CYBSP_I3C_SDA_IRQ ioss_interrupts_gpio_3_IRQn
#define CYBSP_OSPI_RAM_D0_ENABLED 1U
#define CYBSP_OSPI_RAM_D0_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D0_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D0_PIN 0U
#define CYBSP_OSPI_RAM_D0_NUM 0U
#define CYBSP_OSPI_RAM_D0_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D0_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_0_HSIOM
    #define ioss_0_port_4_pin_0_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D0_HSIOM ioss_0_port_4_pin_0_HSIOM
#define CYBSP_OSPI_RAM_D0_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D1_ENABLED 1U
#define CYBSP_OSPI_RAM_D1_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D1_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D1_PIN 1U
#define CYBSP_OSPI_RAM_D1_NUM 1U
#define CYBSP_OSPI_RAM_D1_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D1_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_1_HSIOM
    #define ioss_0_port_4_pin_1_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D1_HSIOM ioss_0_port_4_pin_1_HSIOM
#define CYBSP_OSPI_RAM_D1_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D2_ENABLED 1U
#define CYBSP_OSPI_RAM_D2_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D2_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D2_PIN 2U
#define CYBSP_OSPI_RAM_D2_NUM 2U
#define CYBSP_OSPI_RAM_D2_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D2_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_2_HSIOM
    #define ioss_0_port_4_pin_2_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D2_HSIOM ioss_0_port_4_pin_2_HSIOM
#define CYBSP_OSPI_RAM_D2_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D3_ENABLED 1U
#define CYBSP_OSPI_RAM_D3_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D3_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D3_PIN 3U
#define CYBSP_OSPI_RAM_D3_NUM 3U
#define CYBSP_OSPI_RAM_D3_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_3_HSIOM
    #define ioss_0_port_4_pin_3_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D3_HSIOM ioss_0_port_4_pin_3_HSIOM
#define CYBSP_OSPI_RAM_D3_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D4_ENABLED 1U
#define CYBSP_OSPI_RAM_D4_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D4_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D4_PIN 4U
#define CYBSP_OSPI_RAM_D4_NUM 4U
#define CYBSP_OSPI_RAM_D4_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D4_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_4_HSIOM
    #define ioss_0_port_4_pin_4_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D4_HSIOM ioss_0_port_4_pin_4_HSIOM
#define CYBSP_OSPI_RAM_D4_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D5_ENABLED 1U
#define CYBSP_OSPI_RAM_D5_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D5_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D5_PIN 5U
#define CYBSP_OSPI_RAM_D5_NUM 5U
#define CYBSP_OSPI_RAM_D5_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D5_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_5_HSIOM
    #define ioss_0_port_4_pin_5_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D5_HSIOM ioss_0_port_4_pin_5_HSIOM
#define CYBSP_OSPI_RAM_D5_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D6_ENABLED 1U
#define CYBSP_OSPI_RAM_D6_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D6_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D6_PIN 6U
#define CYBSP_OSPI_RAM_D6_NUM 6U
#define CYBSP_OSPI_RAM_D6_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D6_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_6_HSIOM
    #define ioss_0_port_4_pin_6_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D6_HSIOM ioss_0_port_4_pin_6_HSIOM
#define CYBSP_OSPI_RAM_D6_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_OSPI_RAM_D7_ENABLED 1U
#define CYBSP_OSPI_RAM_D7_PORT (GPIO_PRT_Type *)SMIF1_CORE_SMIF_GPIO_SMIF_PRT0
#define CYBSP_OSPI_RAM_D7_PORT_NUM 4U
#define CYBSP_OSPI_RAM_D7_PIN 7U
#define CYBSP_OSPI_RAM_D7_NUM 7U
#define CYBSP_OSPI_RAM_D7_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_OSPI_RAM_D7_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_7_HSIOM
    #define ioss_0_port_4_pin_7_HSIOM HSIOM_SEL_ACT_15
#endif
#define CYBSP_OSPI_RAM_D7_HSIOM ioss_0_port_4_pin_7_HSIOM
#define CYBSP_OSPI_RAM_D7_IRQ ioss_interrupts_gpio_4_IRQn
#define CYBSP_DEBUG_UART_RX_ENABLED 1U
#define CYBSP_DEBUG_UART_RX_PORT GPIO_PRT6
#define CYBSP_DEBUG_UART_RX_PORT_NUM 6U
#define CYBSP_DEBUG_UART_RX_PIN 5U
#define CYBSP_DEBUG_UART_RX_NUM 5U
#define CYBSP_DEBUG_UART_RX_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DEBUG_UART_RX_INIT_DRIVESTATE 1
#ifndef ioss_0_port_6_pin_5_HSIOM
    #define ioss_0_port_6_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DEBUG_UART_RX_HSIOM ioss_0_port_6_pin_5_HSIOM
#define CYBSP_DEBUG_UART_RX_IRQ ioss_interrupts_gpio_6_IRQn
#define CYBSP_DEBUG_UART_TX_ENABLED 1U
#define CYBSP_DEBUG_UART_TX_PORT GPIO_PRT6
#define CYBSP_DEBUG_UART_TX_PORT_NUM 6U
#define CYBSP_DEBUG_UART_TX_PIN 7U
#define CYBSP_DEBUG_UART_TX_NUM 7U
#define CYBSP_DEBUG_UART_TX_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_DEBUG_UART_TX_INIT_DRIVESTATE 1
#ifndef ioss_0_port_6_pin_7_HSIOM
    #define ioss_0_port_6_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DEBUG_UART_TX_HSIOM ioss_0_port_6_pin_7_HSIOM
#define CYBSP_DEBUG_UART_TX_IRQ ioss_interrupts_gpio_6_IRQn
#define CYBSP_SW1_ENABLED 1U
#define CYBSP_USER_BTN1_ENABLED CYBSP_SW1_ENABLED
#define CYBSP_USER_BTN_ENABLED CYBSP_SW1_ENABLED
#define CYBSP_SW1_PORT GPIO_PRT7
#define CYBSP_USER_BTN1_PORT CYBSP_SW1_PORT
#define CYBSP_USER_BTN_PORT CYBSP_SW1_PORT
#define CYBSP_SW1_PORT_NUM 7U
#define CYBSP_USER_BTN1_PORT_NUM CYBSP_SW1_PORT_NUM
#define CYBSP_USER_BTN_PORT_NUM CYBSP_SW1_PORT_NUM
#define CYBSP_SW1_PIN 0U
#define CYBSP_USER_BTN1_PIN CYBSP_SW1_PIN
#define CYBSP_USER_BTN_PIN CYBSP_SW1_PIN
#define CYBSP_SW1_NUM 0U
#define CYBSP_USER_BTN1_NUM CYBSP_SW1_NUM
#define CYBSP_USER_BTN_NUM CYBSP_SW1_NUM
#define CYBSP_SW1_DRIVEMODE CY_GPIO_DM_PULLUP
#define CYBSP_USER_BTN1_DRIVEMODE CYBSP_SW1_DRIVEMODE
#define CYBSP_USER_BTN_DRIVEMODE CYBSP_SW1_DRIVEMODE
#define CYBSP_SW1_INIT_DRIVESTATE 1
#define CYBSP_USER_BTN1_INIT_DRIVESTATE CYBSP_SW1_INIT_DRIVESTATE
#define CYBSP_USER_BTN_INIT_DRIVESTATE CYBSP_SW1_INIT_DRIVESTATE
#ifndef ioss_0_port_7_pin_0_HSIOM
    #define ioss_0_port_7_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_SW1_HSIOM ioss_0_port_7_pin_0_HSIOM
#define CYBSP_USER_BTN1_HSIOM CYBSP_SW1_HSIOM
#define CYBSP_USER_BTN_HSIOM CYBSP_SW1_HSIOM
#define CYBSP_SW1_IRQ ioss_interrupts_gpio_7_IRQn
#define CYBSP_USER_BTN1_IRQ CYBSP_SW1_IRQ
#define CYBSP_USER_BTN_IRQ CYBSP_SW1_IRQ
#define CYBSP_EXT_CLK_ENABLED 1U
#define CYBSP_EXT_CLK_PORT GPIO_PRT7
#define CYBSP_EXT_CLK_PORT_NUM 7U
#define CYBSP_EXT_CLK_PIN 4U
#define CYBSP_EXT_CLK_NUM 4U
#define CYBSP_EXT_CLK_DRIVEMODE CY_GPIO_DM_ANALOG
#define CYBSP_EXT_CLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_7_pin_4_HSIOM
    #define ioss_0_port_7_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_EXT_CLK_HSIOM ioss_0_port_7_pin_4_HSIOM
#define CYBSP_EXT_CLK_IRQ ioss_interrupts_gpio_7_IRQn
#define CYBSP_I2C_SCL_1V8_ENABLED 1U
#define CYBSP_I2C_SCL_ENABLED CYBSP_I2C_SCL_1V8_ENABLED
#define CYBSP_I2C_SCL_1V8_PORT GPIO_PRT8
#define CYBSP_I2C_SCL_PORT CYBSP_I2C_SCL_1V8_PORT
#define CYBSP_I2C_SCL_1V8_PORT_NUM 8U
#define CYBSP_I2C_SCL_PORT_NUM CYBSP_I2C_SCL_1V8_PORT_NUM
#define CYBSP_I2C_SCL_1V8_PIN 0U
#define CYBSP_I2C_SCL_PIN CYBSP_I2C_SCL_1V8_PIN
#define CYBSP_I2C_SCL_1V8_NUM 0U
#define CYBSP_I2C_SCL_NUM CYBSP_I2C_SCL_1V8_NUM
#define CYBSP_I2C_SCL_1V8_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_I2C_SCL_DRIVEMODE CYBSP_I2C_SCL_1V8_DRIVEMODE
#define CYBSP_I2C_SCL_1V8_INIT_DRIVESTATE 1
#define CYBSP_I2C_SCL_INIT_DRIVESTATE CYBSP_I2C_SCL_1V8_INIT_DRIVESTATE
#ifndef ioss_0_port_8_pin_0_HSIOM
    #define ioss_0_port_8_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2C_SCL_1V8_HSIOM ioss_0_port_8_pin_0_HSIOM
#define CYBSP_I2C_SCL_HSIOM CYBSP_I2C_SCL_1V8_HSIOM
#define CYBSP_I2C_SCL_1V8_IRQ ioss_interrupts_gpio_8_IRQn
#define CYBSP_I2C_SCL_IRQ CYBSP_I2C_SCL_1V8_IRQ
#define CYBSP_I2C_SDA_1V8_ENABLED 1U
#define CYBSP_I2C_SDA_ENABLED CYBSP_I2C_SDA_1V8_ENABLED
#define CYBSP_I2C_SDA_1V8_PORT GPIO_PRT8
#define CYBSP_I2C_SDA_PORT CYBSP_I2C_SDA_1V8_PORT
#define CYBSP_I2C_SDA_1V8_PORT_NUM 8U
#define CYBSP_I2C_SDA_PORT_NUM CYBSP_I2C_SDA_1V8_PORT_NUM
#define CYBSP_I2C_SDA_1V8_PIN 1U
#define CYBSP_I2C_SDA_PIN CYBSP_I2C_SDA_1V8_PIN
#define CYBSP_I2C_SDA_1V8_NUM 1U
#define CYBSP_I2C_SDA_NUM CYBSP_I2C_SDA_1V8_NUM
#define CYBSP_I2C_SDA_1V8_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_I2C_SDA_DRIVEMODE CYBSP_I2C_SDA_1V8_DRIVEMODE
#define CYBSP_I2C_SDA_1V8_INIT_DRIVESTATE 1
#define CYBSP_I2C_SDA_INIT_DRIVESTATE CYBSP_I2C_SDA_1V8_INIT_DRIVESTATE
#ifndef ioss_0_port_8_pin_1_HSIOM
    #define ioss_0_port_8_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2C_SDA_1V8_HSIOM ioss_0_port_8_pin_1_HSIOM
#define CYBSP_I2C_SDA_HSIOM CYBSP_I2C_SDA_1V8_HSIOM
#define CYBSP_I2C_SDA_1V8_IRQ ioss_interrupts_gpio_8_IRQn
#define CYBSP_I2C_SDA_IRQ CYBSP_I2C_SDA_1V8_IRQ
#define CYBSP_PDM_CLK_ENABLED 1U
#define CYBSP_PDM_CLK_PORT GPIO_PRT8
#define CYBSP_PDM_CLK_PORT_NUM 8U
#define CYBSP_PDM_CLK_PIN 5U
#define CYBSP_PDM_CLK_NUM 5U
#define CYBSP_PDM_CLK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_PDM_CLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_8_pin_5_HSIOM
    #define ioss_0_port_8_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_PDM_CLK_HSIOM ioss_0_port_8_pin_5_HSIOM
#define CYBSP_PDM_CLK_IRQ ioss_interrupts_gpio_8_IRQn
#define CYBSP_PDM_DATA_ENABLED 1U
#define CYBSP_PDM_DATA_PORT GPIO_PRT8
#define CYBSP_PDM_DATA_PORT_NUM 8U
#define CYBSP_PDM_DATA_PIN 6U
#define CYBSP_PDM_DATA_NUM 6U
#define CYBSP_PDM_DATA_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_PDM_DATA_INIT_DRIVESTATE 1
#ifndef ioss_0_port_8_pin_6_HSIOM
    #define ioss_0_port_8_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_PDM_DATA_HSIOM ioss_0_port_8_pin_6_HSIOM
#define CYBSP_PDM_DATA_IRQ ioss_interrupts_gpio_8_IRQn
#define CYBSP_SERIAL_INT_0_ENABLED 1U
#define CYBSP_SERIAL_INT_0_PORT GPIO_PRT9
#define CYBSP_SERIAL_INT_0_PORT_NUM 9U
#define CYBSP_SERIAL_INT_0_PIN 0U
#define CYBSP_SERIAL_INT_0_NUM 0U
#define CYBSP_SERIAL_INT_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_SERIAL_INT_0_INIT_DRIVESTATE 1
#ifndef ioss_0_port_9_pin_0_HSIOM
    #define ioss_0_port_9_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_SERIAL_INT_0_HSIOM ioss_0_port_9_pin_0_HSIOM
#define CYBSP_SERIAL_INT_0_IRQ ioss_interrupts_gpio_9_IRQn
#define CYBSP_SERIAL_INT_2_ENABLED 1U
#define CYBSP_SERIAL_INT_2_PORT GPIO_PRT9
#define CYBSP_SERIAL_INT_2_PORT_NUM 9U
#define CYBSP_SERIAL_INT_2_PIN 2U
#define CYBSP_SERIAL_INT_2_NUM 2U
#define CYBSP_SERIAL_INT_2_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_SERIAL_INT_2_INIT_DRIVESTATE 1
#ifndef ioss_0_port_9_pin_2_HSIOM
    #define ioss_0_port_9_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_SERIAL_INT_2_HSIOM ioss_0_port_9_pin_2_HSIOM
#define CYBSP_SERIAL_INT_2_IRQ ioss_interrupts_gpio_9_IRQn
#define CYBSP_BT_UART_RX_ENABLED 1U
#define CYBSP_BT_UART_RX_PORT GPIO_PRT10
#define CYBSP_BT_UART_RX_PORT_NUM 10U
#define CYBSP_BT_UART_RX_PIN 0U
#define CYBSP_BT_UART_RX_NUM 0U
#define CYBSP_BT_UART_RX_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_BT_UART_RX_INIT_DRIVESTATE 1
#ifndef ioss_0_port_10_pin_0_HSIOM
    #define ioss_0_port_10_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_UART_RX_HSIOM ioss_0_port_10_pin_0_HSIOM
#define CYBSP_BT_UART_RX_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_BT_UART_TX_ENABLED 1U
#define CYBSP_BT_UART_TX_PORT GPIO_PRT10
#define CYBSP_BT_UART_TX_PORT_NUM 10U
#define CYBSP_BT_UART_TX_PIN 1U
#define CYBSP_BT_UART_TX_NUM 1U
#define CYBSP_BT_UART_TX_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_BT_UART_TX_INIT_DRIVESTATE 1
#ifndef ioss_0_port_10_pin_1_HSIOM
    #define ioss_0_port_10_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_UART_TX_HSIOM ioss_0_port_10_pin_1_HSIOM
#define CYBSP_BT_UART_TX_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_BT_UART_CTS_ENABLED 1U
#define CYBSP_BT_UART_CTS_PORT GPIO_PRT10
#define CYBSP_BT_UART_CTS_PORT_NUM 10U
#define CYBSP_BT_UART_CTS_PIN 2U
#define CYBSP_BT_UART_CTS_NUM 2U
#define CYBSP_BT_UART_CTS_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_BT_UART_CTS_INIT_DRIVESTATE 0
#ifndef ioss_0_port_10_pin_2_HSIOM
    #define ioss_0_port_10_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_UART_CTS_HSIOM ioss_0_port_10_pin_2_HSIOM
#define CYBSP_BT_UART_CTS_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_BT_UART_RTS_ENABLED 1U
#define CYBSP_BT_UART_RTS_PORT GPIO_PRT10
#define CYBSP_BT_UART_RTS_PORT_NUM 10U
#define CYBSP_BT_UART_RTS_PIN 3U
#define CYBSP_BT_UART_RTS_NUM 3U
#define CYBSP_BT_UART_RTS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_BT_UART_RTS_INIT_DRIVESTATE 0
#ifndef ioss_0_port_10_pin_3_HSIOM
    #define ioss_0_port_10_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_UART_RTS_HSIOM ioss_0_port_10_pin_3_HSIOM
#define CYBSP_BT_UART_RTS_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_BT_HOST_WAKE_ENABLED 1U
#define CYBSP_BT_HOST_WAKE_PORT GPIO_PRT10
#define CYBSP_BT_HOST_WAKE_PORT_NUM 10U
#define CYBSP_BT_HOST_WAKE_PIN 4U
#define CYBSP_BT_HOST_WAKE_NUM 4U
#define CYBSP_BT_HOST_WAKE_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_BT_HOST_WAKE_INIT_DRIVESTATE 0
#ifndef ioss_0_port_10_pin_4_HSIOM
    #define ioss_0_port_10_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_HOST_WAKE_HSIOM ioss_0_port_10_pin_4_HSIOM
#define CYBSP_BT_HOST_WAKE_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_USER_LED2_ENABLED 1U
#define CYBSP_USER_LED2_PORT GPIO_PRT10
#define CYBSP_USER_LED2_PORT_NUM 10U
#define CYBSP_USER_LED2_PIN 5U
#define CYBSP_USER_LED2_NUM 5U
#define CYBSP_USER_LED2_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_USER_LED2_INIT_DRIVESTATE 0
#ifndef ioss_0_port_10_pin_5_HSIOM
    #define ioss_0_port_10_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_USER_LED2_HSIOM ioss_0_port_10_pin_5_HSIOM
#define CYBSP_USER_LED2_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_BT_DEVICE_WAKE_ENABLED 1U
#define CYBSP_BT_DEVICE_WAKE_PORT GPIO_PRT10
#define CYBSP_BT_DEVICE_WAKE_PORT_NUM 10U
#define CYBSP_BT_DEVICE_WAKE_PIN 6U
#define CYBSP_BT_DEVICE_WAKE_NUM 6U
#define CYBSP_BT_DEVICE_WAKE_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_BT_DEVICE_WAKE_INIT_DRIVESTATE 0
#ifndef ioss_0_port_10_pin_6_HSIOM
    #define ioss_0_port_10_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_DEVICE_WAKE_HSIOM ioss_0_port_10_pin_6_HSIOM
#define CYBSP_BT_DEVICE_WAKE_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_USER_LED1_ENABLED 1U
#define CYBSP_USER_LED_ENABLED CYBSP_USER_LED1_ENABLED
#define CYBSP_USER_LED1_PORT GPIO_PRT10
#define CYBSP_USER_LED_PORT CYBSP_USER_LED1_PORT
#define CYBSP_USER_LED1_PORT_NUM 10U
#define CYBSP_USER_LED_PORT_NUM CYBSP_USER_LED1_PORT_NUM
#define CYBSP_USER_LED1_PIN 7U
#define CYBSP_USER_LED_PIN CYBSP_USER_LED1_PIN
#define CYBSP_USER_LED1_NUM 7U
#define CYBSP_USER_LED_NUM CYBSP_USER_LED1_NUM
#define CYBSP_USER_LED1_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_USER_LED_DRIVEMODE CYBSP_USER_LED1_DRIVEMODE
#define CYBSP_USER_LED1_INIT_DRIVESTATE 0
#define CYBSP_USER_LED_INIT_DRIVESTATE CYBSP_USER_LED1_INIT_DRIVESTATE
#ifndef ioss_0_port_10_pin_7_HSIOM
    #define ioss_0_port_10_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_USER_LED1_HSIOM ioss_0_port_10_pin_7_HSIOM
#define CYBSP_USER_LED_HSIOM CYBSP_USER_LED1_HSIOM
#define CYBSP_USER_LED1_IRQ ioss_interrupts_gpio_10_IRQn
#define CYBSP_USER_LED_IRQ CYBSP_USER_LED1_IRQ
#define CYBSP_BT_POWER_ENABLED 1U
#define CYBSP_BT_POWER_PORT GPIO_PRT11
#define CYBSP_BT_POWER_PORT_NUM 11U
#define CYBSP_BT_POWER_PIN 0U
#define CYBSP_BT_POWER_NUM 0U
#define CYBSP_BT_POWER_DRIVEMODE CY_GPIO_DM_PULLUP
#define CYBSP_BT_POWER_INIT_DRIVESTATE 1
#ifndef ioss_0_port_11_pin_0_HSIOM
    #define ioss_0_port_11_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_BT_POWER_HSIOM ioss_0_port_11_pin_0_HSIOM
#define CYBSP_BT_POWER_IRQ ioss_interrupts_gpio_11_IRQn
#define CYBSP_DVP_CAM_PCLK_ENABLED 1U
#define CYBSP_DVP_CAM_PCLK_PORT GPIO_PRT11
#define CYBSP_DVP_CAM_PCLK_PORT_NUM 11U
#define CYBSP_DVP_CAM_PCLK_PIN 1U
#define CYBSP_DVP_CAM_PCLK_NUM 1U
#define CYBSP_DVP_CAM_PCLK_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_PCLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_11_pin_1_HSIOM
    #define ioss_0_port_11_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_PCLK_HSIOM ioss_0_port_11_pin_1_HSIOM
#define CYBSP_DVP_CAM_PCLK_IRQ ioss_interrupts_gpio_11_IRQn
#define CYBSP_WIFI_WL_REG_ON_ENABLED 1U
#define CYBSP_WIFI_WL_REG_ON_PORT GPIO_PRT11
#define CYBSP_WIFI_WL_REG_ON_PORT_NUM 11U
#define CYBSP_WIFI_WL_REG_ON_PIN 4U
#define CYBSP_WIFI_WL_REG_ON_NUM 4U
#define CYBSP_WIFI_WL_REG_ON_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_WIFI_WL_REG_ON_INIT_DRIVESTATE 1
#ifndef ioss_0_port_11_pin_4_HSIOM
    #define ioss_0_port_11_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_WL_REG_ON_HSIOM ioss_0_port_11_pin_4_HSIOM
#define CYBSP_WIFI_WL_REG_ON_IRQ ioss_interrupts_gpio_11_IRQn
#define CYBSP_WIFI_HOST_WAKE_ENABLED 1U
#define CYBSP_WIFI_HOST_WAKE_PORT GPIO_PRT11
#define CYBSP_WIFI_HOST_WAKE_PORT_NUM 11U
#define CYBSP_WIFI_HOST_WAKE_PIN 6U
#define CYBSP_WIFI_HOST_WAKE_NUM 6U
#define CYBSP_WIFI_HOST_WAKE_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_WIFI_HOST_WAKE_INIT_DRIVESTATE 1
#ifndef ioss_0_port_11_pin_6_HSIOM
    #define ioss_0_port_11_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_HOST_WAKE_HSIOM ioss_0_port_11_pin_6_HSIOM
#define CYBSP_WIFI_HOST_WAKE_IRQ ioss_interrupts_gpio_11_IRQn
#define CYBSP_WIFI_SDIO_CLK_ENABLED 1U
#define CYBSP_WIFI_SDIO_CLK_PORT GPIO_PRT12
#define CYBSP_WIFI_SDIO_CLK_PORT_NUM 12U
#define CYBSP_WIFI_SDIO_CLK_PIN 0U
#define CYBSP_WIFI_SDIO_CLK_NUM 0U
#define CYBSP_WIFI_SDIO_CLK_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_CLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_0_HSIOM
