micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_pins.h
    #define ioss_0_port_12_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_CLK_HSIOM ioss_0_port_12_pin_0_HSIOM
#define CYBSP_WIFI_SDIO_CLK_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_WIFI_SDIO_D0_ENABLED 1U
#define CYBSP_WIFI_SDIO_D0_PORT GPIO_PRT12
#define CYBSP_WIFI_SDIO_D0_PORT_NUM 12U
#define CYBSP_WIFI_SDIO_D0_PIN 1U
#define CYBSP_WIFI_SDIO_D0_NUM 1U
#define CYBSP_WIFI_SDIO_D0_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_D0_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_1_HSIOM
    #define ioss_0_port_12_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_D0_HSIOM ioss_0_port_12_pin_1_HSIOM
#define CYBSP_WIFI_SDIO_D0_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_WIFI_SDIO_D1_ENABLED 1U
#define CYBSP_WIFI_SDIO_D1_PORT GPIO_PRT12
#define CYBSP_WIFI_SDIO_D1_PORT_NUM 12U
#define CYBSP_WIFI_SDIO_D1_PIN 2U
#define CYBSP_WIFI_SDIO_D1_NUM 2U
#define CYBSP_WIFI_SDIO_D1_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_D1_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_2_HSIOM
    #define ioss_0_port_12_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_D1_HSIOM ioss_0_port_12_pin_2_HSIOM
#define CYBSP_WIFI_SDIO_D1_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_I2S_TX_FSYNC_ENABLED 1U
#define CYBSP_I2S_TX_FSYNC_PORT GPIO_PRT12
#define CYBSP_I2S_TX_FSYNC_PORT_NUM 12U
#define CYBSP_I2S_TX_FSYNC_PIN 3U
#define CYBSP_I2S_TX_FSYNC_NUM 3U
#define CYBSP_I2S_TX_FSYNC_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_I2S_TX_FSYNC_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_3_HSIOM
    #define ioss_0_port_12_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2S_TX_FSYNC_HSIOM ioss_0_port_12_pin_3_HSIOM
#define CYBSP_I2S_TX_FSYNC_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_WIFI_SDIO_D2_ENABLED 1U
#define CYBSP_WIFI_SDIO_D2_PORT GPIO_PRT12
#define CYBSP_WIFI_SDIO_D2_PORT_NUM 12U
#define CYBSP_WIFI_SDIO_D2_PIN 4U
#define CYBSP_WIFI_SDIO_D2_NUM 4U
#define CYBSP_WIFI_SDIO_D2_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_D2_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_4_HSIOM
    #define ioss_0_port_12_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_D2_HSIOM ioss_0_port_12_pin_4_HSIOM
#define CYBSP_WIFI_SDIO_D2_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_WIFI_SDIO_D3_ENABLED 1U
#define CYBSP_WIFI_SDIO_D3_PORT GPIO_PRT12
#define CYBSP_WIFI_SDIO_D3_PORT_NUM 12U
#define CYBSP_WIFI_SDIO_D3_PIN 5U
#define CYBSP_WIFI_SDIO_D3_NUM 5U
#define CYBSP_WIFI_SDIO_D3_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_D3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_12_pin_5_HSIOM
    #define ioss_0_port_12_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_D3_HSIOM ioss_0_port_12_pin_5_HSIOM
#define CYBSP_WIFI_SDIO_D3_IRQ ioss_interrupts_gpio_12_IRQn
#define CYBSP_DVP_CAM_D0_ENABLED 1U
#define CYBSP_DVP_CAM_D0_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D0_PORT_NUM 16U
#define CYBSP_DVP_CAM_D0_PIN 0U
#define CYBSP_DVP_CAM_D0_NUM 0U
#define CYBSP_DVP_CAM_D0_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D0_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_0_HSIOM
    #define ioss_0_port_16_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D0_HSIOM ioss_0_port_16_pin_0_HSIOM
#define CYBSP_DVP_CAM_D0_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D1_ENABLED 1U
#define CYBSP_DVP_CAM_D1_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D1_PORT_NUM 16U
#define CYBSP_DVP_CAM_D1_PIN 1U
#define CYBSP_DVP_CAM_D1_NUM 1U
#define CYBSP_DVP_CAM_D1_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D1_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_1_HSIOM
    #define ioss_0_port_16_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D1_HSIOM ioss_0_port_16_pin_1_HSIOM
#define CYBSP_DVP_CAM_D1_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D2_ENABLED 1U
#define CYBSP_DVP_CAM_D2_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D2_PORT_NUM 16U
#define CYBSP_DVP_CAM_D2_PIN 2U
#define CYBSP_DVP_CAM_D2_NUM 2U
#define CYBSP_DVP_CAM_D2_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D2_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_2_HSIOM
    #define ioss_0_port_16_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D2_HSIOM ioss_0_port_16_pin_2_HSIOM
#define CYBSP_DVP_CAM_D2_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D3_ENABLED 1U
#define CYBSP_DVP_CAM_D3_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D3_PORT_NUM 16U
#define CYBSP_DVP_CAM_D3_PIN 3U
#define CYBSP_DVP_CAM_D3_NUM 3U
#define CYBSP_DVP_CAM_D3_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_3_HSIOM
    #define ioss_0_port_16_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D3_HSIOM ioss_0_port_16_pin_3_HSIOM
#define CYBSP_DVP_CAM_D3_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D4_ENABLED 1U
#define CYBSP_DVP_CAM_D4_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D4_PORT_NUM 16U
#define CYBSP_DVP_CAM_D4_PIN 4U
#define CYBSP_DVP_CAM_D4_NUM 4U
#define CYBSP_DVP_CAM_D4_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D4_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_4_HSIOM
    #define ioss_0_port_16_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D4_HSIOM ioss_0_port_16_pin_4_HSIOM
#define CYBSP_DVP_CAM_D4_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D5_ENABLED 1U
#define CYBSP_DVP_CAM_D5_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D5_PORT_NUM 16U
#define CYBSP_DVP_CAM_D5_PIN 5U
#define CYBSP_DVP_CAM_D5_NUM 5U
#define CYBSP_DVP_CAM_D5_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D5_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_5_HSIOM
    #define ioss_0_port_16_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D5_HSIOM ioss_0_port_16_pin_5_HSIOM
#define CYBSP_DVP_CAM_D5_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D6_ENABLED 1U
#define CYBSP_DVP_CAM_D6_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D6_PORT_NUM 16U
#define CYBSP_DVP_CAM_D6_PIN 6U
#define CYBSP_DVP_CAM_D6_NUM 6U
#define CYBSP_DVP_CAM_D6_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D6_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_6_HSIOM
    #define ioss_0_port_16_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D6_HSIOM ioss_0_port_16_pin_6_HSIOM
#define CYBSP_DVP_CAM_D6_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_DVP_CAM_D7_ENABLED 1U
#define CYBSP_DVP_CAM_D7_PORT GPIO_PRT16
#define CYBSP_DVP_CAM_D7_PORT_NUM 16U
#define CYBSP_DVP_CAM_D7_PIN 7U
#define CYBSP_DVP_CAM_D7_NUM 7U
#define CYBSP_DVP_CAM_D7_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_D7_INIT_DRIVESTATE 1
#ifndef ioss_0_port_16_pin_7_HSIOM
    #define ioss_0_port_16_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_D7_HSIOM ioss_0_port_16_pin_7_HSIOM
#define CYBSP_DVP_CAM_D7_IRQ ioss_interrupts_gpio_16_IRQn
#define CYBSP_I2C_SCL_3V3_ENABLED 1U
#define CYBSP_I2C_SCL_3V3_PORT GPIO_PRT17
#define CYBSP_I2C_SCL_3V3_PORT_NUM 17U
#define CYBSP_I2C_SCL_3V3_PIN 0U
#define CYBSP_I2C_SCL_3V3_NUM 0U
#define CYBSP_I2C_SCL_3V3_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_I2C_SCL_3V3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_17_pin_0_HSIOM
    #define ioss_0_port_17_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2C_SCL_3V3_HSIOM ioss_0_port_17_pin_0_HSIOM
#define CYBSP_I2C_SCL_3V3_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_I2C_SDA_3V3_ENABLED 1U
#define CYBSP_I2C_SDA_3V3_PORT GPIO_PRT17
#define CYBSP_I2C_SDA_3V3_PORT_NUM 17U
#define CYBSP_I2C_SDA_3V3_PIN 1U
#define CYBSP_I2C_SDA_3V3_NUM 1U
#define CYBSP_I2C_SDA_3V3_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CYBSP_I2C_SDA_3V3_INIT_DRIVESTATE 1
#ifndef ioss_0_port_17_pin_1_HSIOM
    #define ioss_0_port_17_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2C_SDA_3V3_HSIOM ioss_0_port_17_pin_1_HSIOM
#define CYBSP_I2C_SDA_3V3_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_DVP_CAM_VSYNC_ENABLED 1U
#define CYBSP_DVP_CAM_VSYNC_PORT GPIO_PRT17
#define CYBSP_DVP_CAM_VSYNC_PORT_NUM 17U
#define CYBSP_DVP_CAM_VSYNC_PIN 2U
#define CYBSP_DVP_CAM_VSYNC_NUM 2U
#define CYBSP_DVP_CAM_VSYNC_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_VSYNC_INIT_DRIVESTATE 0
#ifndef ioss_0_port_17_pin_2_HSIOM
    #define ioss_0_port_17_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_VSYNC_HSIOM ioss_0_port_17_pin_2_HSIOM
#define CYBSP_DVP_CAM_VSYNC_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_DVP_CAM_HREF_ENABLED 1U
#define CYBSP_DVP_CAM_HREF_PORT GPIO_PRT17
#define CYBSP_DVP_CAM_HREF_PORT_NUM 17U
#define CYBSP_DVP_CAM_HREF_PIN 3U
#define CYBSP_DVP_CAM_HREF_NUM 3U
#define CYBSP_DVP_CAM_HREF_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_DVP_CAM_HREF_INIT_DRIVESTATE 1
#ifndef ioss_0_port_17_pin_3_HSIOM
    #define ioss_0_port_17_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_HREF_HSIOM ioss_0_port_17_pin_3_HSIOM
#define CYBSP_DVP_CAM_HREF_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_DVP_CAM_XCLK_ENABLED 1U
#define CYBSP_DVP_CAM_XCLK_PORT GPIO_PRT17
#define CYBSP_DVP_CAM_XCLK_PORT_NUM 17U
#define CYBSP_DVP_CAM_XCLK_PIN 4U
#define CYBSP_DVP_CAM_XCLK_NUM 4U
#define CYBSP_DVP_CAM_XCLK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_DVP_CAM_XCLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_17_pin_4_HSIOM
    #define ioss_0_port_17_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_XCLK_HSIOM ioss_0_port_17_pin_4_HSIOM
#define CYBSP_DVP_CAM_XCLK_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_DVP_CAM_RESET_ENABLED 1U
#define CYBSP_DVP_CAM_RESET_PORT GPIO_PRT17
#define CYBSP_DVP_CAM_RESET_PORT_NUM 17U
#define CYBSP_DVP_CAM_RESET_PIN 5U
#define CYBSP_DVP_CAM_RESET_NUM 5U
#define CYBSP_DVP_CAM_RESET_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_DVP_CAM_RESET_INIT_DRIVESTATE 1
#ifndef ioss_0_port_17_pin_5_HSIOM
    #define ioss_0_port_17_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_RESET_HSIOM ioss_0_port_17_pin_5_HSIOM
#define CYBSP_DVP_CAM_RESET_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_DVP_CAM_PWDN_ENABLED 1U
#define CYBSP_DVP_CAM_PWDN_PORT GPIO_PRT17
#define CYBSP_DVP_CAM_PWDN_PORT_NUM 17U
#define CYBSP_DVP_CAM_PWDN_PIN 7U
#define CYBSP_DVP_CAM_PWDN_NUM 7U
#define CYBSP_DVP_CAM_PWDN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_DVP_CAM_PWDN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_17_pin_7_HSIOM
    #define ioss_0_port_17_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_DVP_CAM_PWDN_HSIOM ioss_0_port_17_pin_7_HSIOM
#define CYBSP_DVP_CAM_PWDN_IRQ ioss_interrupts_gpio_17_IRQn
#define CYBSP_WCO_OUT_ENABLED 1U
#define CYBSP_WCO_OUT_PORT GPIO_PRT18
#define CYBSP_WCO_OUT_PORT_NUM 18U
#define CYBSP_WCO_OUT_PIN 0U
#define CYBSP_WCO_OUT_NUM 0U
#define CYBSP_WCO_OUT_DRIVEMODE CY_GPIO_DM_ANALOG
#define CYBSP_WCO_OUT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_18_pin_0_HSIOM
    #define ioss_0_port_18_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WCO_OUT_HSIOM ioss_0_port_18_pin_0_HSIOM
#define CYBSP_WCO_OUT_IRQ ioss_interrupts_gpio_18_IRQn
#define CYBSP_WCO_IN_ENABLED 1U
#define CYBSP_WCO_IN_PORT GPIO_PRT18
#define CYBSP_WCO_IN_PORT_NUM 18U
#define CYBSP_WCO_IN_PIN 1U
#define CYBSP_WCO_IN_NUM 1U
#define CYBSP_WCO_IN_DRIVEMODE CY_GPIO_DM_ANALOG
#define CYBSP_WCO_IN_INIT_DRIVESTATE 1
#ifndef ioss_0_port_18_pin_1_HSIOM
    #define ioss_0_port_18_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WCO_IN_HSIOM ioss_0_port_18_pin_1_HSIOM
#define CYBSP_WCO_IN_IRQ ioss_interrupts_gpio_18_IRQn
#define CYBSP_ECO_IN_ENABLED 1U
#define CYBSP_ECO_IN_PORT GPIO_PRT19
#define CYBSP_ECO_IN_PORT_NUM 19U
#define CYBSP_ECO_IN_PIN 0U
#define CYBSP_ECO_IN_NUM 0U
#define CYBSP_ECO_IN_DRIVEMODE CY_GPIO_DM_ANALOG
#define CYBSP_ECO_IN_INIT_DRIVESTATE 1
#ifndef ioss_0_port_19_pin_0_HSIOM
    #define ioss_0_port_19_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_ECO_IN_HSIOM ioss_0_port_19_pin_0_HSIOM
#define CYBSP_ECO_IN_IRQ ioss_interrupts_gpio_19_IRQn
#define CYBSP_ECO_OUT_ENABLED 1U
#define CYBSP_ECO_OUT_PORT GPIO_PRT19
#define CYBSP_ECO_OUT_PORT_NUM 19U
#define CYBSP_ECO_OUT_PIN 1U
#define CYBSP_ECO_OUT_NUM 1U
#define CYBSP_ECO_OUT_DRIVEMODE CY_GPIO_DM_ANALOG
#define CYBSP_ECO_OUT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_19_pin_1_HSIOM
    #define ioss_0_port_19_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_ECO_OUT_HSIOM ioss_0_port_19_pin_1_HSIOM
#define CYBSP_ECO_OUT_IRQ ioss_interrupts_gpio_19_IRQn
#define CYBSP_RADAR_INT_ENABLED 1U
#define CYBSP_RADAR_INT_PORT GPIO_PRT20
#define CYBSP_RADAR_INT_PORT_NUM 20U
#define CYBSP_RADAR_INT_PIN 3U
#define CYBSP_RADAR_INT_NUM 3U
#define CYBSP_RADAR_INT_DRIVEMODE CY_GPIO_DM_PULLDOWN_IN_OFF
#define CYBSP_RADAR_INT_INIT_DRIVESTATE 0
#ifndef ioss_0_port_20_pin_3_HSIOM
    #define ioss_0_port_20_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RADAR_INT_HSIOM ioss_0_port_20_pin_3_HSIOM
#define CYBSP_RADAR_INT_IRQ ioss_interrupts_gpio_20_IRQn
#define CYBSP_LED_RGB_GREEN_ENABLED 1U
#define CYBSP_USER_LED5_ENABLED CYBSP_LED_RGB_GREEN_ENABLED
#define CYBSP_LED_RGB_GREEN_PORT GPIO_PRT20
#define CYBSP_USER_LED5_PORT CYBSP_LED_RGB_GREEN_PORT
#define CYBSP_LED_RGB_GREEN_PORT_NUM 20U
#define CYBSP_USER_LED5_PORT_NUM CYBSP_LED_RGB_GREEN_PORT_NUM
#define CYBSP_LED_RGB_GREEN_PIN 4U
#define CYBSP_USER_LED5_PIN CYBSP_LED_RGB_GREEN_PIN
#define CYBSP_LED_RGB_GREEN_NUM 4U
#define CYBSP_USER_LED5_NUM CYBSP_LED_RGB_GREEN_NUM
#define CYBSP_LED_RGB_GREEN_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_USER_LED5_DRIVEMODE CYBSP_LED_RGB_GREEN_DRIVEMODE
#define CYBSP_LED_RGB_GREEN_INIT_DRIVESTATE 0
#define CYBSP_USER_LED5_INIT_DRIVESTATE CYBSP_LED_RGB_GREEN_INIT_DRIVESTATE
#ifndef ioss_0_port_20_pin_4_HSIOM
    #define ioss_0_port_20_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_LED_RGB_GREEN_HSIOM ioss_0_port_20_pin_4_HSIOM
#define CYBSP_USER_LED5_HSIOM CYBSP_LED_RGB_GREEN_HSIOM
#define CYBSP_LED_RGB_GREEN_IRQ ioss_interrupts_gpio_20_IRQn
#define CYBSP_USER_LED5_IRQ CYBSP_LED_RGB_GREEN_IRQ
#define CYBSP_LED_RGB_BLUE_ENABLED 1U
#define CYBSP_USER_LED4_ENABLED CYBSP_LED_RGB_BLUE_ENABLED
#define CYBSP_LED_RGB_BLUE_PORT GPIO_PRT20
#define CYBSP_USER_LED4_PORT CYBSP_LED_RGB_BLUE_PORT
#define CYBSP_LED_RGB_BLUE_PORT_NUM 20U
#define CYBSP_USER_LED4_PORT_NUM CYBSP_LED_RGB_BLUE_PORT_NUM
#define CYBSP_LED_RGB_BLUE_PIN 5U
#define CYBSP_USER_LED4_PIN CYBSP_LED_RGB_BLUE_PIN
#define CYBSP_LED_RGB_BLUE_NUM 5U
#define CYBSP_USER_LED4_NUM CYBSP_LED_RGB_BLUE_NUM
#define CYBSP_LED_RGB_BLUE_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_USER_LED4_DRIVEMODE CYBSP_LED_RGB_BLUE_DRIVEMODE
#define CYBSP_LED_RGB_BLUE_INIT_DRIVESTATE 0
#define CYBSP_USER_LED4_INIT_DRIVESTATE CYBSP_LED_RGB_BLUE_INIT_DRIVESTATE
#ifndef ioss_0_port_20_pin_5_HSIOM
    #define ioss_0_port_20_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_LED_RGB_BLUE_HSIOM ioss_0_port_20_pin_5_HSIOM
#define CYBSP_USER_LED4_HSIOM CYBSP_LED_RGB_BLUE_HSIOM
#define CYBSP_LED_RGB_BLUE_IRQ ioss_interrupts_gpio_20_IRQn
#define CYBSP_USER_LED4_IRQ CYBSP_LED_RGB_BLUE_IRQ
#define CYBSP_LED_RGB_RED_ENABLED 1U
#define CYBSP_USER_LED3_ENABLED CYBSP_LED_RGB_RED_ENABLED
#define CYBSP_LED_RGB_RED_PORT GPIO_PRT20
#define CYBSP_USER_LED3_PORT CYBSP_LED_RGB_RED_PORT
#define CYBSP_LED_RGB_RED_PORT_NUM 20U
#define CYBSP_USER_LED3_PORT_NUM CYBSP_LED_RGB_RED_PORT_NUM
#define CYBSP_LED_RGB_RED_PIN 6U
#define CYBSP_USER_LED3_PIN CYBSP_LED_RGB_RED_PIN
#define CYBSP_LED_RGB_RED_NUM 6U
#define CYBSP_USER_LED3_NUM CYBSP_LED_RGB_RED_NUM
#define CYBSP_LED_RGB_RED_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_USER_LED3_DRIVEMODE CYBSP_LED_RGB_RED_DRIVEMODE
#define CYBSP_LED_RGB_RED_INIT_DRIVESTATE 0
#define CYBSP_USER_LED3_INIT_DRIVESTATE CYBSP_LED_RGB_RED_INIT_DRIVESTATE
#ifndef ioss_0_port_20_pin_6_HSIOM
    #define ioss_0_port_20_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_LED_RGB_RED_HSIOM ioss_0_port_20_pin_6_HSIOM
#define CYBSP_USER_LED3_HSIOM CYBSP_LED_RGB_RED_HSIOM
#define CYBSP_LED_RGB_RED_IRQ ioss_interrupts_gpio_20_IRQn
#define CYBSP_USER_LED3_IRQ CYBSP_LED_RGB_RED_IRQ
#define CYBSP_RXRES_L_ENABLED 1U
#define CYBSP_RADAR_RESET_ENABLED CYBSP_RXRES_L_ENABLED
#define CYBSP_RXRES_L_PORT GPIO_PRT20
#define CYBSP_RADAR_RESET_PORT CYBSP_RXRES_L_PORT
#define CYBSP_RXRES_L_PORT_NUM 20U
#define CYBSP_RADAR_RESET_PORT_NUM CYBSP_RXRES_L_PORT_NUM
#define CYBSP_RXRES_L_PIN 7U
#define CYBSP_RADAR_RESET_PIN CYBSP_RXRES_L_PIN
#define CYBSP_RXRES_L_NUM 7U
#define CYBSP_RADAR_RESET_NUM CYBSP_RXRES_L_NUM
#define CYBSP_RXRES_L_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_RADAR_RESET_DRIVEMODE CYBSP_RXRES_L_DRIVEMODE
#define CYBSP_RXRES_L_INIT_DRIVESTATE 1
#define CYBSP_RADAR_RESET_INIT_DRIVESTATE CYBSP_RXRES_L_INIT_DRIVESTATE
#ifndef ioss_0_port_20_pin_7_HSIOM
    #define ioss_0_port_20_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RXRES_L_HSIOM ioss_0_port_20_pin_7_HSIOM
#define CYBSP_RADAR_RESET_HSIOM CYBSP_RXRES_L_HSIOM
#define CYBSP_RXRES_L_IRQ ioss_interrupts_gpio_20_IRQn
#define CYBSP_RADAR_RESET_IRQ CYBSP_RXRES_L_IRQ
#define CYBSP_WIFI_SDIO_CMD_ENABLED 1U
#define CYBSP_WIFI_SDIO_CMD_PORT GPIO_PRT21
#define CYBSP_WIFI_SDIO_CMD_PORT_NUM 21U
#define CYBSP_WIFI_SDIO_CMD_PIN 0U
#define CYBSP_WIFI_SDIO_CMD_NUM 0U
#define CYBSP_WIFI_SDIO_CMD_DRIVEMODE CY_GPIO_DM_STRONG
#define CYBSP_WIFI_SDIO_CMD_INIT_DRIVESTATE 1
#ifndef ioss_0_port_21_pin_0_HSIOM
    #define ioss_0_port_21_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_WIFI_SDIO_CMD_HSIOM ioss_0_port_21_pin_0_HSIOM
#define CYBSP_WIFI_SDIO_CMD_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_I2S_TX_SD_ENABLED 1U
#define CYBSP_I2S_TX_SD_PORT GPIO_PRT21
#define CYBSP_I2S_TX_SD_PORT_NUM 21U
#define CYBSP_I2S_TX_SD_PIN 1U
#define CYBSP_I2S_TX_SD_NUM 1U
#define CYBSP_I2S_TX_SD_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_I2S_TX_SD_INIT_DRIVESTATE 1
#ifndef ioss_0_port_21_pin_1_HSIOM
    #define ioss_0_port_21_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2S_TX_SD_HSIOM ioss_0_port_21_pin_1_HSIOM
#define CYBSP_I2S_TX_SD_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_I2S_TX_SCK_ENABLED 1U
#define CYBSP_I2S_TX_SCK_PORT GPIO_PRT21
#define CYBSP_I2S_TX_SCK_PORT_NUM 21U
#define CYBSP_I2S_TX_SCK_PIN 2U
#define CYBSP_I2S_TX_SCK_NUM 2U
#define CYBSP_I2S_TX_SCK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_I2S_TX_SCK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_21_pin_2_HSIOM
    #define ioss_0_port_21_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2S_TX_SCK_HSIOM ioss_0_port_21_pin_2_HSIOM
#define CYBSP_I2S_TX_SCK_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_I2S_TX_MCK_ENABLED 1U
#define CYBSP_I2S_TX_MCK_PORT GPIO_PRT21
#define CYBSP_I2S_TX_MCK_PORT_NUM 21U
#define CYBSP_I2S_TX_MCK_PIN 3U
#define CYBSP_I2S_TX_MCK_NUM 3U
#define CYBSP_I2S_TX_MCK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_I2S_TX_MCK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_21_pin_3_HSIOM
    #define ioss_0_port_21_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_I2S_TX_MCK_HSIOM ioss_0_port_21_pin_3_HSIOM
#define CYBSP_I2S_TX_MCK_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_RSPI_MISO_ENABLED 1U
#define CYBSP_SPI_MISO_ENABLED CYBSP_RSPI_MISO_ENABLED
#define CYBSP_RSPI_MISO_PORT GPIO_PRT21
#define CYBSP_SPI_MISO_PORT CYBSP_RSPI_MISO_PORT
#define CYBSP_RSPI_MISO_PORT_NUM 21U
#define CYBSP_SPI_MISO_PORT_NUM CYBSP_RSPI_MISO_PORT_NUM
#define CYBSP_RSPI_MISO_PIN 4U
#define CYBSP_SPI_MISO_PIN CYBSP_RSPI_MISO_PIN
#define CYBSP_RSPI_MISO_NUM 4U
#define CYBSP_SPI_MISO_NUM CYBSP_RSPI_MISO_NUM
#define CYBSP_RSPI_MISO_DRIVEMODE CY_GPIO_DM_HIGHZ
#define CYBSP_SPI_MISO_DRIVEMODE CYBSP_RSPI_MISO_DRIVEMODE
#define CYBSP_RSPI_MISO_INIT_DRIVESTATE 1
#define CYBSP_SPI_MISO_INIT_DRIVESTATE CYBSP_RSPI_MISO_INIT_DRIVESTATE
#ifndef ioss_0_port_21_pin_4_HSIOM
    #define ioss_0_port_21_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RSPI_MISO_HSIOM ioss_0_port_21_pin_4_HSIOM
#define CYBSP_SPI_MISO_HSIOM CYBSP_RSPI_MISO_HSIOM
#define CYBSP_RSPI_MISO_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_SPI_MISO_IRQ CYBSP_RSPI_MISO_IRQ
#define CYBSP_RSPI_MOSI_ENABLED 1U
#define CYBSP_SPI_MOSI_ENABLED CYBSP_RSPI_MOSI_ENABLED
#define CYBSP_RSPI_MOSI_PORT GPIO_PRT21
#define CYBSP_SPI_MOSI_PORT CYBSP_RSPI_MOSI_PORT
#define CYBSP_RSPI_MOSI_PORT_NUM 21U
#define CYBSP_SPI_MOSI_PORT_NUM CYBSP_RSPI_MOSI_PORT_NUM
#define CYBSP_RSPI_MOSI_PIN 5U
#define CYBSP_SPI_MOSI_PIN CYBSP_RSPI_MOSI_PIN
#define CYBSP_RSPI_MOSI_NUM 5U
#define CYBSP_SPI_MOSI_NUM CYBSP_RSPI_MOSI_NUM
#define CYBSP_RSPI_MOSI_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_SPI_MOSI_DRIVEMODE CYBSP_RSPI_MOSI_DRIVEMODE
#define CYBSP_RSPI_MOSI_INIT_DRIVESTATE 1
#define CYBSP_SPI_MOSI_INIT_DRIVESTATE CYBSP_RSPI_MOSI_INIT_DRIVESTATE
#ifndef ioss_0_port_21_pin_5_HSIOM
    #define ioss_0_port_21_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RSPI_MOSI_HSIOM ioss_0_port_21_pin_5_HSIOM
#define CYBSP_SPI_MOSI_HSIOM CYBSP_RSPI_MOSI_HSIOM
#define CYBSP_RSPI_MOSI_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_SPI_MOSI_IRQ CYBSP_RSPI_MOSI_IRQ
#define CYBSP_RSPI_CLK_ENABLED 1U
#define CYBSP_SPI_CLK_ENABLED CYBSP_RSPI_CLK_ENABLED
#define CYBSP_RSPI_CLK_PORT GPIO_PRT21
#define CYBSP_SPI_CLK_PORT CYBSP_RSPI_CLK_PORT
#define CYBSP_RSPI_CLK_PORT_NUM 21U
#define CYBSP_SPI_CLK_PORT_NUM CYBSP_RSPI_CLK_PORT_NUM
#define CYBSP_RSPI_CLK_PIN 6U
#define CYBSP_SPI_CLK_PIN CYBSP_RSPI_CLK_PIN
#define CYBSP_RSPI_CLK_NUM 6U
#define CYBSP_SPI_CLK_NUM CYBSP_RSPI_CLK_NUM
#define CYBSP_RSPI_CLK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_SPI_CLK_DRIVEMODE CYBSP_RSPI_CLK_DRIVEMODE
#define CYBSP_RSPI_CLK_INIT_DRIVESTATE 1
#define CYBSP_SPI_CLK_INIT_DRIVESTATE CYBSP_RSPI_CLK_INIT_DRIVESTATE
#ifndef ioss_0_port_21_pin_6_HSIOM
    #define ioss_0_port_21_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RSPI_CLK_HSIOM ioss_0_port_21_pin_6_HSIOM
#define CYBSP_SPI_CLK_HSIOM CYBSP_RSPI_CLK_HSIOM
#define CYBSP_RSPI_CLK_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_SPI_CLK_IRQ CYBSP_RSPI_CLK_IRQ
#define CYBSP_RSPI_CS_ENABLED 1U
#define CYBSP_SPI_CS_ENABLED CYBSP_RSPI_CS_ENABLED
#define CYBSP_RSPI_CS_PORT GPIO_PRT21
#define CYBSP_SPI_CS_PORT CYBSP_RSPI_CS_PORT
#define CYBSP_RSPI_CS_PORT_NUM 21U
#define CYBSP_SPI_CS_PORT_NUM CYBSP_RSPI_CS_PORT_NUM
#define CYBSP_RSPI_CS_PIN 7U
#define CYBSP_SPI_CS_PIN CYBSP_RSPI_CS_PIN
#define CYBSP_RSPI_CS_NUM 7U
#define CYBSP_SPI_CS_NUM CYBSP_RSPI_CS_NUM
#define CYBSP_RSPI_CS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define CYBSP_SPI_CS_DRIVEMODE CYBSP_RSPI_CS_DRIVEMODE
#define CYBSP_RSPI_CS_INIT_DRIVESTATE 1
#define CYBSP_SPI_CS_INIT_DRIVESTATE CYBSP_RSPI_CS_INIT_DRIVESTATE
#ifndef ioss_0_port_21_pin_7_HSIOM
    #define ioss_0_port_21_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define CYBSP_RSPI_CS_HSIOM ioss_0_port_21_pin_7_HSIOM
#define CYBSP_SPI_CS_HSIOM CYBSP_RSPI_CS_HSIOM
#define CYBSP_RSPI_CS_IRQ ioss_interrupts_gpio_21_IRQn
#define CYBSP_SPI_CS_IRQ CYBSP_RSPI_CS_IRQ

