micropython/micropython/ports/psoc-edge/boards/KIT_PSE84_AI/bsp-cfg/cycfg_pins.h
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_CS_config;

#define CYBSP_OSPI_RAM_SS_config CYBSP_OSPI_RAM_CS_config

extern const cy_stc_gpio_pin_config_t CYBSP_QSPI_D0_config;
extern const cy_stc_gpio_pin_config_t CYBSP_QSPI_D1_config;
extern const cy_stc_gpio_pin_config_t CYBSP_QSPI_D2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_QSPI_D3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_QSPI_CS_config;

#define CYBSP_QSPI_SS_config CYBSP_QSPI_CS_config

extern const cy_stc_gpio_pin_config_t CYBSP_I3C_SCL_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I3C_SDA_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D0_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D1_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D4_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D5_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D6_config;
extern const cy_stc_gpio_pin_config_t CYBSP_OSPI_RAM_D7_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DEBUG_UART_RX_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DEBUG_UART_TX_config;
extern const cy_stc_gpio_pin_config_t CYBSP_SW1_config;

#define CYBSP_USER_BTN1_config CYBSP_SW1_config
#define CYBSP_USER_BTN_config CYBSP_SW1_config

extern const cy_stc_gpio_pin_config_t CYBSP_EXT_CLK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2C_SCL_1V8_config;

#define CYBSP_I2C_SCL_config CYBSP_I2C_SCL_1V8_config

extern const cy_stc_gpio_pin_config_t CYBSP_I2C_SDA_1V8_config;

#define CYBSP_I2C_SDA_config CYBSP_I2C_SDA_1V8_config

extern const cy_stc_gpio_pin_config_t CYBSP_PDM_CLK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_PDM_DATA_config;
extern const cy_stc_gpio_pin_config_t CYBSP_SERIAL_INT_0_config;
extern const cy_stc_gpio_pin_config_t CYBSP_SERIAL_INT_2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_UART_RX_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_UART_TX_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_UART_CTS_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_UART_RTS_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_HOST_WAKE_config;
extern const cy_stc_gpio_pin_config_t CYBSP_USER_LED2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_BT_DEVICE_WAKE_config;
extern const cy_stc_gpio_pin_config_t CYBSP_USER_LED1_config;

#define CYBSP_USER_LED_config CYBSP_USER_LED1_config

extern const cy_stc_gpio_pin_config_t CYBSP_BT_POWER_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_PCLK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_WL_REG_ON_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_HOST_WAKE_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_CLK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_D0_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_D1_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2S_TX_FSYNC_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_D2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_D3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D0_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D1_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D2_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D4_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D5_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D6_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_D7_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2C_SCL_3V3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2C_SDA_3V3_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_VSYNC_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_HREF_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_XCLK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_RESET_config;
extern const cy_stc_gpio_pin_config_t CYBSP_DVP_CAM_PWDN_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WCO_OUT_config;
extern const cy_stc_gpio_pin_config_t CYBSP_WCO_IN_config;
extern const cy_stc_gpio_pin_config_t CYBSP_ECO_IN_config;
extern const cy_stc_gpio_pin_config_t CYBSP_ECO_OUT_config;
extern const cy_stc_gpio_pin_config_t CYBSP_RADAR_INT_config;
extern const cy_stc_gpio_pin_config_t CYBSP_LED_RGB_GREEN_config;

#define CYBSP_USER_LED5_config CYBSP_LED_RGB_GREEN_config

extern const cy_stc_gpio_pin_config_t CYBSP_LED_RGB_BLUE_config;

#define CYBSP_USER_LED4_config CYBSP_LED_RGB_BLUE_config

extern const cy_stc_gpio_pin_config_t CYBSP_LED_RGB_RED_config;

#define CYBSP_USER_LED3_config CYBSP_LED_RGB_RED_config

extern const cy_stc_gpio_pin_config_t CYBSP_RXRES_L_config;

#define CYBSP_RADAR_RESET_config CYBSP_RXRES_L_config

extern const cy_stc_gpio_pin_config_t CYBSP_WIFI_SDIO_CMD_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2S_TX_SD_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2S_TX_SCK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_I2S_TX_MCK_config;
extern const cy_stc_gpio_pin_config_t CYBSP_RSPI_MISO_config;

#define CYBSP_SPI_MISO_config CYBSP_RSPI_MISO_config

extern const cy_stc_gpio_pin_config_t CYBSP_RSPI_MOSI_config;

#define CYBSP_SPI_MOSI_config CYBSP_RSPI_MOSI_config

extern const cy_stc_gpio_pin_config_t CYBSP_RSPI_CLK_config;

#define CYBSP_SPI_CLK_config CYBSP_RSPI_CLK_config

extern const cy_stc_gpio_pin_config_t CYBSP_RSPI_CS_config;

#define CYBSP_SPI_CS_config CYBSP_RSPI_CS_config

void init_cycfg_pins(void);

#if defined(__cplusplus)
}
#endif /* defined(__cplusplus) */

#endif /* CYCFG_PINS_H */
